# -*- coding: utf-8 -*-
"""
Created on Wed Jan  1 12:56:27 2020

@author: chiakai
"""

#提供要取名的適當字(str格式，字與字之間以、隔開)、生辰、性別等資料，會自動前往靈匣網站查詢分數，大於targetScore的會LineNotify並回覆全部好名字典
def iterGoodName(surname, word, sex, year, month, day, hour, minute, targetScore, token):
    #好名字空字典備用
    goodName = dict()
    
    from goodName import goodName
    
    #屬猴適用之字庫
    goodWord = list(set(word.replace('、',"")))
    
    #Line發報函數LineNotify
    def lineNotify(token, msg, imageThumbnail, imageFullsize):
        import requests
        url = "https://notify-api.line.me/api/notify"
        headers = {
                "Authorization": "Bearer " + token
                }
        payload_Pic = {'message': msg, 'imageThumbnail': imageThumbnail, 'imageFullsize': imageFullsize}
        payload_Msg = {'message': msg}
        try:
            r = requests.post(url, headers = headers, params = payload_Pic, verify =False)
        except:
            r = requests.post(url, headers = headers, params = payload_Msg, verify =False)
        return r.status_code 
    
    for i in goodWord:
        for j in goodWord:
            tempName = i+j
            print('>>'+tempName)
            try:
                msg, wuxing, score, wuxing_score = goodName(surname, tempName, sex, year, month, day, hour, minute)
                print(msg)
                if ('水' in wuxing) or ('木' in wuxing):
                    pass
                else:
                    if float(score) >= float(targetScore):
                        lineNotify(token, msg, "", "")
                        goodName[tempName] = msg
            except Exception as e:
                msg = f'\n查詢姓名：「張{tempName}」時出錯，出錯原因：\n{e}'          
    return goodName

if __name__ == '__main__':
    surname = '林'
    sex = '0'
    year = '2015'
    month = '9'
    day = '10'
    hour = '3'
    minute = '1'
    token = ''
    word = '人、仁、介、今、仍、仕、筱、代、令、以、仰、任、仲、仿、企、伊、伍、休、伶、布、佐、佑、何、余、餘、作、佩、來、依、俊、俐、促、俏、信、修、值、倩、偉、健、備、傑、傅、儀、依、優、儷、言、計、訓、許、訴、詞、試、詩、詹、語、誠、誼、謀、諾、謙、證、識、議、警、讓、小、少、亞、次、臣、子、孔、字、存、泳、泉、泰、洋、洞、孝、孜、李、孫、學、孽、孺、農、辰、宸、依、麗、貝、真、慶、麟、麒、晨、宸、水、永、冰、求、澤、汐、湄、池、江、汝、汪、沉、沂、沈、沐、沙、沛、河、沼、治、沿、漲、法、湘、泯、津、洪、活、洗、浚、浩、海、涵、淮、塗、清、渙、淵、遊、湊、湧、湖、湘、湯、源、溶、滿、漢、潔、澈、澤、濁、濃、濟、濤、酥、醇、酌、酷、酒、鵑、鳳、嗚、鶴、翊、非、兆、翌、雅、集、雄、鷹、雙、雁、成、戰、狄、狂、狀、猛、然、城、荿、形、衫、彤、彥、彬、影、彰、彭、布、希、緯、巾、師、席、帷、常、沛、紳、約、紅、級、紛、素、紡、紫、絢、絲、絹、經、綠、綢、綺、維、縯、衣、表、袁、裕、襄、釋、示、祁、祝、祜、祖、崇、祥、祿、棋、禮、立、站、童、彰、宇、宜、宗、安、宙、厘、原、廈、厝、序、庇、床、庫、庚、穹、空、究、穿、回、囷、黎、黏、黐、顆、棵、夥、芋、茄、桃、瓜、柑、夕、夜、黑、暗、多、夢、夥、外、一、人、乃、大、上、巾、土、女、壬、水、公、天、化、升、夫、民、司、仔、申、巧、玉、代、巨、左、北、布、丞、仲、伍、全、合、在、圭、至、行、匡、同、存、守、求、百、因、字、汀、而、自、衣、亨、伯、吾、位、壯、伸、妙、吟、坊、孝、序、冶、含、呈、孜、何、巫、享、京、居、奇、放、長、其、旺、宗、妮、函、夜、佩、佳、信、厚、帝、政、昱、河、治、泉、法、扁、俊、客、封、首、美、春、哈、泳、盈、音、南、貞、沼、員、洞、記、修、倉、倍、倚、城、師、拯、站、玲、珍、素、娜、娥、神、宮、時、納、紓、紡、高、唐、孫、袁、洪、馬、國、祥、基、堂、堅、得、振、茂、培、教、浡、浴、敏、旋、商、專、珩、紾、野、康、偵、彬、堇、欽、淼、球、詔、開、超、越、備、淦、寓、猛、間、婷、媚、媛、淑、荏、閔、貽、費、貴、順、雅、喜、捷、清、理、雲、善、涼、統、傳、勤、揚、群、祿、嗣、裔、圓、湄、絹、詢、祺、毓、農、湜、園、詹、境、實、彰、臺、賓、領、察、幕、舞、綜、齊、滋、綠、綿、僑、誥、增、漢、漳、諒、履、嘯、滿、瑤、嬌、儀、諄、滸、衛、賢、謀、龍、縉、謁、曈、曇、曉、蓀、績、賽、孺、謄、闈、濃、韓、謝、濱、環、織、謹、儱、顏、龎、璽、韻、麗、寵、繪、龐、嚴、寶、繼、議、釋、續、顧、藹、龔、纓、隴、讓、乃、人、力、丈、上、久、于、千、口、土、士、大、子、寸、巾、中、丹、尹、云、井、仁、仍、今、介、元、允、內、公、化、升、壬、天、夫、太、孔、少、手、水、王、主、以、付、仔、仕、代、令、兄、凸、北、可、右、司、台、句、巨、巧、左、本、母、民、永、玄、立、汀、丞、仿、伊、伍、休、仲、任、企、光、全、匡、吉、吏、同、向、名、合、因、回、在、圭、如、字、存、宇、守、安、曲、次、百、竹、羽、而、臣、自、至、行、衣、求、汝、亨、位、何、佐、佑、似、作、伯、佈、冶、吾、呈、含、吟、坊、均、壯、妙、妍、妤、孝、孜、宏、巫、希、序、形、攸、杏、材、村、杉、每、言、貝、走、足、辰、妘、技、沛、沐、沂、玖、亞、享、京、依、佳、來、佩、侑、兩、典、函、周、坪、夜、奉、奇、孟、季、定、官、宜、宙、尚、居、幸、府、征、承、放、於、杭、東、果、林、松、直、知、采、長、雨、青、政、汯、佶、注、泳、河、法、治、亮、信、俠、促、俊、係、冠、勁、南、厚、品、垣、城、奕、奎、客、封、帝、彥、昱、柱、柏、泉、爰、盈、紅、美、衍、貞、軍、音、首、泰、俅、垚、姵、芳、芸、持、拱、拯、拾、洋、洲、洪、洞、玲、珍、倍、倆、倚、俱、候、修、倪、倫、倉、唐、哲、員、堉、娟、孫、宮、容、宸、展、師、庫、座、旅、時、桓、桂、桔、栩、桐、格、桃、真、祐、站、紡、純、級、納、袁、記、訓、起、馬、高、珂、倜、旆、紝、紘、紓、若、茂、英、振、海、浚、浴、珮、乾、偌、做、偉、健、偵、偯、凰、區、商、國、域、堅、基、堂、培、尉、專、常、康、彬、得、御、徠、教、啟、敏、族、旋、晨、梵、梧、祥、符、笙、統、紹、訪、許、責、苙、浤、浡、浯、珩、埼、婕、娸、茵、茴、荏、捷、授、涼、淳、清、淇、淋、涵、深、淦、球、理、備、傑、勝、博、喜、喻、喬、圍、堪、堤、堡、壺、婷、媚、媛、復、循、朝、棠、棟、森、棉、登、竣、策、筆、筑、善、舒、詠、評、詞、証、詔、賀、貴、越、超、開、閎、雲、順、馮、淥、琇、喨、婼、媜、淼、詒、雱、郁、荷、揮、援、揚、湘、滋、渙、湄、湲、琳、傳、僅、勤、嗣、園、圓、塘、彙、新、楚、毓、祿、筠、絹、義、群、裔、裘、裕、詩、詮、詹、農、靖、湜、筥、郡、萊、溶、滇、僖、僑、嘉、圖、境、嫣、實、彰、徹、旗、睿、禎、綽、綠、綺、綢、綿、綵、維、聚、肇、臺、舞、語、誥、賓、領、颯、魁、菉、瑋、墉、漳、漢、滿、瑤、瑪、億、儀、儂、增、寬、履、德、徵、慶、樣、樟、樂、緯、緻、衛、誼、諒、諄、調、論、賞、賦、賢、質、輝、震、滸、槿、霈、蓉、蒞、蒲、蓀、蓓、潔、儒、儔、儐、勳、學、樺、橙、橋、穎、穆、縈、縉、興、衡、諺、謀、諮、霖、頤、龍、蒨、澐、璇、叡、圜、隆、隄、擇、濃、澤、償、儲、嬪、孺、檀、檜、營、績、總、繁、聯、臨、謙、謝、謄、豁、賽、趨、駿、黛、霝、龠、濱、濟、濤、濬、濡、環、璨、檳、禮、繕、謹、豐、顏、儱、騏、薔、薇、寵、繹、識、證、贊、辭、韻、麗、嚴、寶、竇、競、籌、繽、繼、纂、覺、議、警、譯、騰、齡、瀧、藝、瓏、儷、櫻、續、覽、譽、露、蘋、讀、孋、驊、灑、驗、麟、欒、纕、隴、靈、靄、讚、灤、驤、驪、倢、秝、秫、秦、純、紡、紗、紟、紝、宭、隺、帨、師、姬、娟、娣、娳、娥、娊、賑、賏、幑、嫦、嫙、粿、綸、綖、綧、郡、菓、雅、眖、貽、媚、媛、婕、捷、粢、傃、絲、詠、馭、雁'
    targetScore = 88
    result = iterGoodName(surname, word, sex, year, month, day, hour, minute, targetScore, token)